Revit 2027 API
ParameterTypeId.PathReinEndHookTypen1 Property
 "Primary Bar - End Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PathReinEndHookTypen1 { get; }
Public Shared ReadOnly Property PathReinEndHookTypen1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PathReinEndHookTypen1 {
	ForgeTypeId^ get ();
}
static member PathReinEndHookTypen1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace